//题一：

//*****************************************************************
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//*****************************************************************

#include<stdio.h>
#include<Windows.h>

int main()
{
	int a, b, c, d, e;
	for (a = 1; a <= 5; a++){
		for (b = 1; b <= 5; b++){
			if (a != b){
				for (c = 1; c <= 5; c++){
					if (a != c&&b != c){
						for (d = 1; d <= 5; d++){
							if (a != d&&b != d&&c != d){
								e = 15 - a - b - c - d;
								if (\
									(((a == 3) + (b == 2)) == 1) && \
									(((b == 2) + (e == 4)) == 1) && \
									(((c == 1) + (d == 2)) == 1) && \
									(((c == 5) + (d == 3)) == 1) && \
									(((e == 4) + (a == 1)) == 1) ){
									printf("a=%d\nb=%d\nc=%d\nd=%d\ne=%d\n", a, b, c, d, e);
								}
							}
						}
					}
				}
			}
		}
	}
	system("pause");
	return 0;
}


//题二：

//*****************************************************************
//警察对4个人进行排查，其中只有一个是嫌疑犯。以下为4个嫌疑犯的供词。
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//*****************************************************************

#include<stdio.h>
#include<Windows.h>

int main()
{
	char x = '0';
	for (x = 'A'; x <= 'D'; x++){
		if (((x != 'A') + (x == 'C') + (x == 'D') + (x != 'D')) == 3){
			printf("%c is a crimer!\n", x);
		}
	}
	system("pause");
	return 0;
}
